Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException Constructor (Expression, OperatorType, Expression, InvalidFilterExpressionExceptionReasonsType)
 Initializes a new instance of the InvalidFilterExpressionException class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidFilterExpressionException(
	Expression LeftExpression,
	OperatorType OperatorType,
	Expression RightExpression,
	InvalidFilterExpressionExceptionReasonsType InvalidFilterExpressionExceptionReasonsType
)
Public Sub New (
	LeftExpression As Expression,
	OperatorType As OperatorType,
	RightExpression As Expression,
	InvalidFilterExpressionExceptionReasonsType As InvalidFilterExpressionExceptionReasonsType
)
Parameters
LeftExpression
Type: Tekla.Structures.Filtering.Expression
The invalid expression's left operand.
OperatorType
Type: Tekla.Structures.Filtering.OperatorType
The invalid expression's operator type.
RightExpression
Type: Tekla.Structures.Filtering.Expression
The invalid expression's right operand.
InvalidFilterExpressionExceptionReasonsType
Type: Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType
The reason why the exception is thrown.
See Also
Reference
InvalidFilterExpressionException Class
InvalidFilterExpressionException Overload
Tekla.Structures.Filtering Namespace